## importing libraries

In [ ]:
import pandas as pd

## loading the dataset

In [ ]:
df = pd.read_csv('sample.csv')

In [ ]:
df.head()

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude
0,1,Melinde,Shilburne,Female,Nowa Ruda,Assistant Professor,$57438.18,50.577407,16.496718
1,2,Kimberly,Von Welden,Female,Bulgan,Programmer II,$62846.60,48.823157,103.521820
2,3,Alvera,Di Boldi,Female,NaN,NaN,$57576.52,39.994746,116.339772
3,4,Shannon,O'Griffin,Male,Divnomorskoye,Budget/Accounting Analyst II,$61489.23,44.504721,38.130017
4,5,Sherwood,Macieja,Male,Mytishchi,VP Sales,$63863.09,NaN,37.648995

In [ ]:
df.tail()

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude
995,996,Kathye,Grasser,Female,Dzaoudzi,Accountant IV,$65520.45,-12.782212,45.258209
996,997,Haskell,Kempston,Male,Ban Talat Nua,Biostatistician I,$37021.92,7.912274,98.345973
997,998,Holly-anne,Gerbl,Female,Guanaja,Speech Pathologist,$16200.10,16.482661,-85.879325
998,999,Marysa,Purdie,Female,Sioah,Desktop Support Technician,$95912.44,5.586496,95.351402
999,1000,Jewell,Haselden,Female,Springfield,Business Systems Development Analyst,$30556.12,39.800000,-89.650000

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int64
 1   first_name  1000 non-null   object
 2   last_name   1000 non-null   object
 3   gender      1000 non-null   object
 4   City        999 non-null    object
 5   Job Title   998 non-null    object
 6   Salary      1000 non-null   object
 7   Latitude    999 non-null    float64
 8   Longitude   1000 non-null   float64
dtypes: float64(2), int64(1), object(6)
memory usage: 70.4+ KB

In [ ]:
df.describe()

                id    Latitude    Longitude
count  1000.000000  999.000000  1000.000000
mean    500.500000   25.431517    43.337565
std     288.819436   24.579083    69.420645
min       1.000000  -54.281149  -123.041961
25%     250.750000    7.820010     4.552571
50%     500.500000   31.933972    37.169904
75%     750.250000   43.830899   111.498223
max    1000.000000   69.631860   175.282269

In [ ]:
df.columns

Index(['id', 'first_name', 'last_name', 'gender', 'City', 'Job Title',
       'Salary', 'Latitude', 'Longitude'],
      dtype='object')

In [ ]:
# df.groupby('gender')['Salary'].mean()

TypeError: agg function failed [how->mean,dtype->object]

## converting salary column from object to float

In [ ]:
def clean_salary(salary): # "$10,000.00"
  if isinstance(salary, str):
    return float(salary.replace('$', '').replace(',','')) # "10000" -> 10000
  return float(salary)

df['Salary'] = df['Salary'].apply(clean_salary)

In [ ]:
df['Salary']

0      57438.18
1      62846.60
2      57576.52
3      61489.23
4      63863.09
         ...
995    65520.45
996    37021.92
997    16200.10
998    95912.44
999    30556.12
Name: Salary, Length: 1000, dtype: float64

In [ ]:
df.groupby('gender')['Salary'].mean().reset_index()

   gender        Salary
0  Female  55618.943049
1    Male  55361.093839

In [ ]:
def male_salary(salary):
  if salary['gender'] == 'Male':
    return salary['Salary']

def female_salary(salary):
  if salary['gender'] == 'Female':
    return salary['Salary']

In [ ]:
df['male_salary'] = df.apply(male_salary, axis=1)
df['female_salary'] = df.apply(female_salary, axis=1)

In [ ]:
df.head()

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude,male_salary,female_salary
0,1,Melinde,Shilburne,Female,Nowa Ruda,Assistant Professor,57438.18,50.577407,16.496718,NaN,57438.18
1,2,Kimberly,Von Welden,Female,Bulgan,Programmer II,62846.60,48.823157,103.521820,NaN,62846.60
2,3,Alvera,Di Boldi,Female,NaN,NaN,57576.52,39.994746,116.339772,NaN,57576.52
3,4,Shannon,O'Griffin,Male,Divnomorskoye,Budget/Accounting Analyst II,61489.23,44.504721,38.130017,61489.23,NaN
4,5,Sherwood,Macieja,Male,Mytishchi,VP Sales,63863.09,NaN,37.648995,63863.09,NaN

In [ ]:
df.groupby('Job Title')[['Salary', 'male_salary', 'female_salary']].mean().reset_index()

                      Job Title        Salary   male_salary  female_salary
0           Account Coordinator  48738.521429  51446.623333   46707.445000
1             Account Executive  58718.374000  65415.968000   52020.780000
2      Account Representative I  51116.973333           NaN   51116.973333
3     Account Representative II  41174.805000  40562.700000   41786.910000
4    Account Representative III  22420.710000  22420.710000            NaN
..                          ...           ...           ...            ...
179             Web Designer II  85660.120000  64732.480000   92636.000000
180             Web Designer IV  42073.720000  63039.210000   21108.230000
181             Web Developer I  79405.830000  79405.830000            NaN
182            Web Developer II  23219.355000           NaN   23219.355000
183            Web Developer IV  46697.680000  64010.640000   29384.720000

[184 rows x 4 columns]

In [ ]:
df.groupby(['Job Title','City'])[['Salary', 'male_salary', 'female_salary']].mean().reset_index()

               Job Title         City    Salary  male_salary  female_salary
0    Account Coordinator   Beishidian  21091.80          NaN       21091.80
1    Account Coordinator      Gengwan  67073.36          NaN       67073.36
2    Account Coordinator  Lluchubamba  84527.06     84527.06            NaN
3    Account Coordinator     Nusajaya  71637.92          NaN       71637.92
4    Account Coordinator     Rajapeni  27026.70          NaN       27026.70
..                   ...          ...       ...          ...            ...
991      Web Developer I        Xine  62755.85     62755.85            NaN
992     Web Developer II       Cacheu  13772.82          NaN       13772.82
993     Web Developer II    Kurayoshi  32665.89          NaN       32665.89
994     Web Developer IV        Borek  64010.64     64010.64            NaN
995     Web Developer IV    Rozkishne  29384.72          NaN       29384.72

[996 rows x 5 columns]

## Handling missing data

mean, median, mode

In [ ]:
df.head()

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude,male_salary,female_salary
0,1,Melinde,Shilburne,Female,Nowa Ruda,Assistant Professor,57438.18,50.577407,16.496718,NaN,57438.18
1,2,Kimberly,Von Welden,Female,Bulgan,Programmer II,62846.60,48.823157,103.521820,NaN,62846.60
2,3,Alvera,Di Boldi,Female,London,NaN,57576.52,39.994746,116.339772,NaN,57576.52
3,4,Shannon,O'Griffin,Male,Divnomorskoye,Budget/Accounting Analyst II,61489.23,44.504721,38.130017,61489.23,NaN
4,5,Sherwood,Macieja,Male,Mytishchi,VP Sales,63863.09,31.933972,37.648995,63863.09,NaN

In [ ]:
# df['City'].fillna('London', inplace=True)  # old method
df.fillna({'City':'London'}, inplace=True) # new method

In [ ]:
median = df['Latitude'].median()
df.fillna({'Latitude': median}, inplace=True)

## removing rows containing NaN value

In [ ]:
df.dropna(subset=['Job Title'],inplace=True)

In [ ]:
df.shape

(998, 11)

## Removing Duplicates

In [ ]:
df.drop_duplicates(inplace=True)
df.drop_duplicates(subset=['first_name', 'Job Title'], inplace=True)

In [ ]:
df.shape()

## Conditional Filtering

In [ ]:
df['Salary'] > 50000

0       True
1       True
3       True
4       True
5      False
       ...
995     True
996    False
997    False
998     True
999    False
Name: Salary, Length: 998, dtype: bool

In [ ]:
# single condition
df.loc[df['Salary'] > 50000]

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude,male_salary,female_salary
0,1,Melinde,Shilburne,Female,Nowa Ruda,Assistant Professor,57438.18,50.577407,16.496718,NaN,57438.18
1,2,Kimberly,Von Welden,Female,Bulgan,Programmer II,62846.60,48.823157,103.521820,NaN,62846.60
3,4,Shannon,O'Griffin,Male,Divnomorskoye,Budget/Accounting Analyst II,61489.23,44.504721,38.130017,61489.23,NaN
4,5,Sherwood,Macieja,Male,Mytishchi,VP Sales,63863.09,31.933972,37.648995,63863.09,NaN
8,9,Roth,O'Cannavan,Male,Heitan,VP Product Management,73697.10,32.027934,106.657113,73697.10,NaN
...,...,...,...,...,...,...,...,...,...,...,...
991,992,Scotti,Dusey,Male,Medveditskiy,Senior Cost Accountant,75714.21,50.784291,44.712888,75714.21,NaN
992,993,Levi,Ramsell,Male,Lluchubamba,Account Coordinator,84527.06,-7.523183,-77.971010,84527.06,NaN
994,995,Niki,Ashbrook,Male,Novozavidovskiy,Media Manager II,67437.88,56.551479,36.434717,67437.88,NaN
995,996,Kathye,Grasser,Female,Dzaoudzi,Accountant IV,65520.45,-12.782212,45.258209,NaN,65520.45
998,999,Marysa,Purdie,Female,Sioah,Desktop Support Technician,95912.44,5.586496,95.351402,NaN,95912.44

In [ ]:
# multiple conditions
(df['Salary'] > 50000) & (df['gender'] == 'Male')

0      False
1      False
3       True
4       True
5      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 998, dtype: bool

In [ ]:
df.loc[(df['Salary'] > 50000) & (df['gender'] == 'Male')]

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude,male_salary,female_salary
3,4,Shannon,O'Griffin,Male,Divnomorskoye,Budget/Accounting Analyst II,61489.23,44.504721,38.130017,61489.23,NaN
4,5,Sherwood,Macieja,Male,Mytishchi,VP Sales,63863.09,31.933972,37.648995,63863.09,NaN
8,9,Roth,O'Cannavan,Male,Heitan,VP Product Management,73697.10,32.027934,106.657113,73697.10,NaN
9,10,Bran,Trahear,Male,Arbelez,Mechanical Systems Engineer,68098.42,4.272793,-74.416014,68098.42,NaN
13,14,Mickie,Whanstall,Male,Springfield,Assistant Media Planner,50838.53,42.101480,-72.576676,50838.53,NaN
...,...,...,...,...,...,...,...,...,...,...,...
988,989,Fabiano,Clinton,Male,Agua,Software Test Engineer II,56279.89,-22.057309,-46.977421,56279.89,NaN
990,991,Mic,Benbough,Male,Arbelez,GIS Technical Architect,89017.71,4.272793,-74.416014,89017.71,NaN
991,992,Scotti,Dusey,Male,Medveditskiy,Senior Cost Accountant,75714.21,50.784291,44.712888,75714.21,NaN
992,993,Levi,Ramsell,Male,Lluchubamba,Account Coordinator,84527.06,-7.523183,-77.971010,84527.06,NaN
994,995,Niki,Ashbrook,Male,Novozavidovskiy,Media Manager II,67437.88,56.551479,36.434717,67437.88,NaN

# sorting the values

In [ ]:
df.sort_values(by='Salary') # ascending order

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude,male_salary,female_salary
619,620,Hamil,Eyckelbeck,Male,Gaoshi,Database Administrator I,10101.92,29.184943,105.055945,10101.92,NaN
581,582,Ramsay,Milam,Male,Jarash,VP Product Management,10210.85,32.274651,35.896076,10210.85,NaN
832,833,Damara,Beaford,Female,Poomia,Environmental Specialist,10616.44,49.989099,18.569972,NaN,10616.44
337,338,Linus,Estcot,Male,Paris 13,VP Quality Control,10760.34,43.494574,5.897802,10760.34,NaN
810,811,Leyla,Huelin,Female,Santa Rita,Marketing Assistant,10766.43,21.013065,-101.854246,NaN,10766.43
...,...,...,...,...,...,...,...,...,...,...,...
899,900,Bancroft,Donisthorpe,Male,Karangtawar,Senior Developer,99638.99,-6.963373,112.336757,99638.99,NaN
36,37,Nicko,Frays,Male,Caxias,Health Coach I,99786.40,-4.865414,-43.361998,99786.40,NaN
84,85,Gothart,Olivey,Male,Zhongcheng,Assistant Media Planner,99942.92,22.356083,112.562369,99942.92,NaN
812,813,Harmonia,Carn,Female,Bangbayang Kaler,Accountant IV,99944.05,-6.751597,107.928790,NaN,99944.05
874,875,Rivy,Adney,Female,Mesopotam,Environmental Specialist,99948.28,39.912087,20.097078,NaN,99948.28

In [ ]:
df.sort_values(by='Salary', ascending=False) # descending order

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude,male_salary,female_salary
874,875,Rivy,Adney,Female,Mesopotam,Environmental Specialist,99948.28,39.912087,20.097078,NaN,99948.28
812,813,Harmonia,Carn,Female,Bangbayang Kaler,Accountant IV,99944.05,-6.751597,107.928790,NaN,99944.05
84,85,Gothart,Olivey,Male,Zhongcheng,Assistant Media Planner,99942.92,22.356083,112.562369,99942.92,NaN
36,37,Nicko,Frays,Male,Caxias,Health Coach I,99786.40,-4.865414,-43.361998,99786.40,NaN
899,900,Bancroft,Donisthorpe,Male,Karangtawar,Senior Developer,99638.99,-6.963373,112.336757,99638.99,NaN
...,...,...,...,...,...,...,...,...,...,...,...
810,811,Leyla,Huelin,Female,Santa Rita,Marketing Assistant,10766.43,21.013065,-101.854246,NaN,10766.43
337,338,Linus,Estcot,Male,Paris 13,VP Quality Control,10760.34,43.494574,5.897802,10760.34,NaN
832,833,Damara,Beaford,Female,Poomia,Environmental Specialist,10616.44,49.989099,18.569972,NaN,10616.44
581,582,Ramsay,Milam,Male,Jarash,VP Product Management,10210.85,32.274651,35.896076,10210.85,NaN
619,620,Hamil,Eyckelbeck,Male,Gaoshi,Database Administrator I,10101.92,29.184943,105.055945,10101.92,NaN

In [ ]:
df.sort_values(by='first_name', ascending=False)

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude,male_salary,female_salary
395,396,Zulema,Mulheron,Female,Troms,Geological Engineer,43382.60,69.631860,18.922100,NaN,43382.60
66,67,Zorine,Dradey,Female,Kembang,Marketing Assistant,88665.42,-6.471274,110.817108,NaN,88665.42
163,164,Zolly,Bonner,Male,Saerhusong,Tax Accountant,89869.39,47.493710,87.541610,89869.39,NaN
708,709,Zaria,Vashchenko,Female,Mombok,Actuary,16810.20,-8.650979,116.324944,NaN,16810.20
268,269,Zachary,Oughtright,Male,Librazhd-Qendr,Dental Hygienist,32805.16,41.136741,20.384833,32805.16,NaN
...,...,...,...,...,...,...,...,...,...,...,...
469,470,Abey,Mesant,Male,Shedok,Sales Associate,74236.08,44.216785,40.842212,74236.08,NaN
639,640,Abelard,Fawbert,Male,Sumurgayam,Marketing Manager,84911.09,-6.888394,112.330797,84911.09,NaN
824,825,Abbye,MacAndreis,Female,Chandman,Accounting Assistant I,87792.30,45.336962,97.968566,NaN,87792.30
513,514,Abbot,Spaice,Male,Baoyou,Speech Pathologist,22066.55,40.657978,109.840313,22066.55,NaN
593,594,Abagail,Franklin,Female,Gengwan,Account Coordinator,67073.36,29.162252,119.729415,NaN,67073.36

In [ ]:
df.sort_values(by=['Job Title','Salary'],ascending=[True,False])

,id,first_name,last_name,gender,City,Job Title,Salary,Latitude,Longitude,male_salary,female_salary
992,993,Levi,Ramsell,Male,Lluchubamba,Account Coordinator,84527.06,-7.523183,-77.971010,84527.06,NaN
203,204,Merle,Ren,Female,Nusajaya,Account Coordinator,71637.92,1.424768,103.648704,NaN,71637.92
593,594,Abagail,Franklin,Female,Gengwan,Account Coordinator,67073.36,29.162252,119.729415,NaN,67073.36
968,969,Hewet,Dulwich,Male,San Agustn,Account Coordinator,46495.22,14.818221,-88.937795,46495.22,NaN
87,88,Carole,Gavan,Female,Rajapeni,Account Coordinator,27026.70,-7.284100,108.214800,NaN,27026.70
...,...,...,...,...,...,...,...,...,...,...,...
20,21,Alon,Chasteau,Male,Xine,Web Developer I,62755.85,49.162910,127.986580,62755.85,NaN
568,569,Valma,Bratton,Female,Kurayoshi,Web Developer II,32665.89,35.449904,133.761331,NaN,32665.89
537,538,Marcellina,Samarth,Female,Cacheu,Web Developer II,13772.82,12.273263,-16.166916,NaN,13772.82
575,576,Sammy,Desesquelle,Male,Borek,Web Developer IV,64010.64,50.537216,15.231116,64010.64,NaN
22,23,Lurleen,Janczak,Female,Rozkishne,Web Developer IV,29384.72,48.490281,39.271222,NaN,29384.72

## Replacing a value

In [ ]:
# df2 = df.replace('Male', 'M').replace('Female', 'F')
df2 = df.replace({'Male': 'M', 'Female': 'F'})
# df2 = df.replace(['Male', 'Female'], ['M', 'F'])

In [ ]:
df2['gender']

0      F
1      F
3      M
4      M
5      F
      ..
995    F
996    M
997    F
998    F
999    F
Name: gender, Length: 998, dtype: object

## Ranking the salary

In [ ]:
df['rank'] = df['Salary'].rank(ascending=False)

In [ ]:
df.sort_values(by='rank')[['Salary', 'rank']]

       Salary   rank
874  99948.28    1.0
812  99944.05    2.0
84   99942.92    3.0
36   99786.40    4.0
899  99638.99    5.0
..        ...    ...
810  10766.43  994.0
337  10760.34  995.0
832  10616.44  996.0
581  10210.85  997.0
619  10101.92  998.0

[998 rows x 2 columns]

In [ ]:
df.to_csv('cleaned_sample.csv', index=False)